module Modalities.Cohesion.test where

open import Foundations.Prelude

-- data ⟨♯|_⟩ {𝓤} (A : Type 𝓤) : Type 𝓤 where
--   mod♯ : @♯ A → ⟨♯| A ⟩

-- {-# MODALOP ⟨♯|_⟩ #-}

-- μ♯ : ∀ {𝓤} {A : Type 𝓤} → ⟨♯| ⟨♯| A ⟩ ⟩ → ⟨♯| A ⟩
-- μ♯ (mod♯ (mod♯ x)) = {!mod♯ ?!}



data ⟨♭|_⟩ {@♭ 𝓤} (@♭ A : Set 𝓤) : Set 𝓤 where
  mod♭ : (@♭ a : A) → ⟨♭| A ⟩


-- The modality pragma means that any modality can split
-- on this type
{-# MODALOP ⟨♭|_⟩ #-}

ε : ∀ {@♭ 𝓤} {@♭ A : Set 𝓤} → ⟨♭| A ⟩ → A
ε (mod♭ a) = a

♭-map : ∀ {@♭ 𝓤 𝓥} {@♭ A : Set 𝓤} {@♭ B : Set 𝓥}
        → ⟨♭| (A → B) ⟩ → ⟨♭| A ⟩ → ⟨♭| B ⟩
♭-map (mod♭ f) (mod♭ x) = mod♭ (f x)

data ⟨♯|_⟩ {𝓤} (@♯ A : Set 𝓤) : Set 𝓤 where
  mod♯ : (@♯ a : A) → ⟨♯| A ⟩

{-# MODALOP ⟨♯|_⟩ #-}

♯-map : ∀ {𝓤 𝓥} {A : Set 𝓤} {B : Set 𝓥}
        → ⟨♯| (A → B) ⟩ → ⟨♯| A ⟩ → ⟨♯| B ⟩
♯-map (mod♯ f) (mod♯ a) = mod♯ (f a)

η : ∀ {𝓤} {A : Set 𝓤} → A → ⟨♯| A ⟩
η a = mod♯ a

-- Will fail type check if uncommented
-- uh-oh : ∀ {𝓤} {A : Set 𝓤} → ⟨♯| A ⟩ → A
-- uh-oh (mod♯ a) = {!a!}

crispy : ∀ {@♭ 𝓤} {@♭ A : Set 𝓤} → @♭ ⟨♯| A ⟩ → A
crispy (mod♯ a) = a

μ : ∀ {𝓤} {A : Set 𝓤} → @♯ ⟨♯| A ⟩ → ⟨♯| A ⟩
μ a = mod♯ (crispy a)

μ' : ∀ {𝓤} {A : Set 𝓤} → ⟨♯| ⟨♯| A ⟩ ⟩ → ⟨♯| A ⟩
μ' (mod♯ (mod♯ a)) = mod♯ a

comul : ∀ {𝓤} {A : Set 𝓤} → ⟨♯| A ⟩ → ⟨♯| ⟨♯| A ⟩ ⟩
comul (mod♯ a) = mod♯ (mod♯ a)

♯-rfl : ∀ {𝓤} {A : Set 𝓤} (B : ⟨♯| A ⟩ → Set 𝓤)
        → (f : (a : A) → ⟨♯| B (η a) ⟩)
        → (a : ⟨♯| A ⟩) → ⟨♯| B a ⟩
♯-rfl B f (mod♯ a) = mod♯ (crispy (f a))

♯-rfl-η : ∀ {𝓤} {A : Set 𝓤} {B : ⟨♯| A ⟩ → Set 𝓤}
        → (f : (a : A) → ⟨♯| B (η a) ⟩)
        → (a : A) → ♯-rfl B f (η a) ＝ f a
♯-rfl-η f a with f a
... | mod♯ b = refl

♭-eat-♯ : ∀ {@♭ 𝓤} {@♭ A : Set 𝓤} → ⟨♭| ⟨♯| A ⟩ ⟩ → ⟨♭| A ⟩
♭-eat-♯ (mod♭ (mod♯ a)) = mod♭ a

♭-eat-♯' : ∀ {@♭ 𝓤} {@♭ A : Set 𝓤} → ⟨♭| A ⟩ → ⟨♭| ⟨♯| A ⟩ ⟩
♭-eat-♯' (mod♭ a) = mod♭ (mod♯ a)

♯-eat-♭ : ∀ {@♭ 𝓤} {@♭ A : Set 𝓤} → ⟨♯| ⟨♭| A ⟩ ⟩ → ⟨♯| A ⟩
♯-eat-♭ (mod♯ (mod♭ a)) = mod♯ a

♯-eat-♭' : ∀ {@♭ 𝓤} {@♭ A : Set 𝓤} → ⟨♯| A ⟩ → ⟨♯| ⟨♭| A ⟩ ⟩
♯-eat-♭' (mod♯ a) = mod♯ (mod♭ a)

♯←♭ : ∀ {@♭ 𝓤} {@♭ A : Set 𝓤} → ⟨♭| A ⟩ → ⟨♯| A ⟩
♯←♭ x = η (ε x)

-- ♭←♯ : ∀ {@♭ 𝓤} {@♭ A : Set 𝓤} → ⟨♯| A ⟩ → ⟨♭| A ⟩
-- ♭←♯ (mod♯ a) = mod♭ {!a!}

adj : ∀ {@♭ 𝓤 𝓥} {@♭ A : Set 𝓤} {B : Set 𝓥}
      → ⟨♯| (⟨♭| A ⟩ → B) ⟩ → (A → ⟨♯| B ⟩)
adj (mod♯ f) a = mod♯ (f (mod♭ a))

adj' : ∀ {@♭ 𝓤 𝓥} {@♭ A : Set 𝓤} {@♭ B : @♭ A → Set 𝓥}
       → ⟨♭| ((a : A) → ⟨♯| B a ⟩)⟩ → ⟨♭| ((@♭ a : A) → B a) ⟩
adj' (mod♭ f) = mod♭ (λ b → crispy (f b))

-- J-♭ : ∀ {@♭ 𝓤} {𝓥} {@♭ A : Set 𝓤} {@♭ a : A}
--             (M : (@♭ b : A) → a ＝ b → Set 𝓥)
--             (Mrfl : M a refl)
--           → ∀ {@♭ b : A} (@♭ p : a ＝ b) → M b p
-- J-♭ M mrfl refl = mrfl

-- J-crisp : ∀ {@♭ 𝓤} {@♭ 𝓥} {@♭ A : Set 𝓤} {@♭ a : A}
--             (@♭ M : (@♭ b : A) → @♭ a ＝ b → Set 𝓥)
--             → @♭ M a refl
--             → ∀ {@♭ b : A} (@♭ p : a ＝ b) → M b p
-- J-crisp M prfl = ε (adj' (mod♭ λ where p → mod♯ (J-♭ (λ b p → {!M b p!}) prfl p)))

-- flat-subst : {@♭ A : Set} {P : A → Set} → (@♭ x y : A) (@♭ p : x ＝ y)
--              → P x → P y
-- flat-subst x .x refl P = P
